{
    "I'm really worried I'm not spending enough time with my kids. It's affecting my mental health.": 
        "Alex, it's completely understandable to feel overwhelmed. Juggling the responsibilities of fatherhood with work and studies can be quite challenging. You love your kids, and that’s what truly matters. Let's explore how you can create those special moments with them.",
    
    "I don't have much time between driving for Uber and studying. I feel guilty about not being present.": 
        "Guilt is something many fathers experience, and it shows how much you care. Remember, quality often trumps quantity. Have you considered incorporating your kids into some of your daily activities? Maybe they could help you with meal prep, turning it into a fun cooking session.",
    
    "That's a great idea! But I'm also struggling with sleep. I find myself awake thinking about everything I have to do.": 
        "Sleep is crucial, especially for a father like you. Establishing a calming bedtime routine can help. Perhaps you could try some gentle stretches or deep-breathing exercises to ease your mind before bed. Remember, taking care of yourself enables you to be more present for your kids.",
    
    "I also need to work less and budget better. I want to be more present for them.": 
        "Absolutely, creating a budget can alleviate some of that pressure. Consider setting aside specific funds for family activities each month. It could be a fun outing to the park or a picnic. Involving your kids in planning these activities can also be a bonding experience.",
    
    "That makes sense. I want to be the best father I can be, but it feels overwhelming sometimes.": 
        "You're doing an incredible job just by being aware of these feelings. It's important to remember that no father is perfect. Sharing your struggles with your kids can teach them valuable lessons about honesty and vulnerability. You’re their role model, and they’ll learn resilience from watching you navigate these challenges.",
    
    "I guess I never thought about it that way. It's just hard sometimes.": 
        "It is hard, Alex, and it’s okay to acknowledge that. You're not alone in this journey. Seeking support from other fathers can be incredibly beneficial. Maybe joining a local or online parenting group could help you connect with others who understand what you’re going through.",
    
    "That sounds helpful. I'll look into it. Thanks for listening and offering advice.": 
        "Always here for you, Alex! Remember, being an engaged father is a journey, not a destination. Celebrate the small victories, and don’t hesitate to reach out when you need support. You’re doing a fantastic job navigating this path.",
    
    "I had an experience with my two boys. The older one hit the other one for snatching one of his toys and proceeded to scream at him  When I intervened and tried to discipline him he mentioned that he reacted this way because this is what he sees from me. (That I yell and I throw things ) I have not hit them but this is quite alarming to me. It made me feel terrible because I not around enough to correctly model better behavior, so when I am around how do I process my feelings of frustration so that I dont ever react in a toxic way again. Im really embarrassed by this and feel awful.": 
        "Seeing your son mirror your reactions with throwing and yelling is tough, but your awareness is the first step to change. When frustration builds, notice your body's signals (tense shoulders, quick breathing). Take a moment in another room, telling your kids 'I need a quick breather.' Take Three deep breaths, then return. When you slip up, model honest repair: 'I'm sorry I yelled. I'm learning better ways to handle big feelings, just like you are.' Remember - kids learn more from how we repair than from our perfect moments."
}
